ESB.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:book="http://schemas.datacontract.org/2004/07/BookManager" xmlns:book1="http://schemas.datacontract.org/2004/07/BookManagerInt">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:UpdateOffer>
            <!--Optional:-->
            <tem:ci>
                <!--Optional:-->
                <book:UserId>206</book:UserId>
                <!--Optional:-->
                <book:PwdHash>MdvnsQx+p78Pwfzga7g179siSd4=</book:PwdHash>
            </tem:ci>
            <!--Optional:-->
            <tem:rightId>64</tem:rightId>
            <!--Optional:-->
            <tem:oldOffer>
                <book1:OfferId>"OfferId"</book1:OfferId>
                <book1:SubEventId>"SubEventId"</book1:SubEventId>
                <book1:OfferName>"OfferName"</book1:OfferName>
                <book1:Status>"Status"</book1:Status>
                <book1:SortOrder>"SortOrder"</book1:SortOrder>
                <book1:PlayerNo>"PlayerNo"</book1:PlayerNo>
                <book1:HAD>"HAD"</book1:HAD>
                <book1:WWRetailReturn>"WWRetailReturn"</book1:WWRetailReturn>
                <book1:WWInternetReturn>"WWInternetReturn"</book1:WWInternetReturn>
                <book1:WWTelebetReturn>"WWTelebetReturn"</book1:WWTelebetReturn>
                <book1:PPRetailReturn>"PPRetailReturn"</book1:PPRetailReturn>
                <book1:PPInternetReturn>"PPInternetReturn"</book1:PPInternetReturn>
                <book1:PPTelebetReturn>"PPTelebetReturn"</book1:PPTelebetReturn>
                <book1:Value1>"Value1"</book1:Value1>
                <book1:Value2>"Value2"</book1:Value2>
                <book1:LateScratching>"LateScratching"</book1:LateScratching>
                <book1:LastSerialNoB4LateScr>"LastSerialNoB4LateScr"</book1:LastSerialNoB4LateScr>
                <book1:Deduction>"Deduction"</book1:Deduction>
                <book1:PlacingPos>"PlacingPos"</book1:PlacingPos>
                <book1:Multiplier>"Multiplier"</book1:Multiplier>
                <book1:CalculationFlag>"CalculationFlag"</book1:CalculationFlag>
                <book1:PlaceMultiplier>"PlaceMultiplier"</book1:PlaceMultiplier>
                <book1:PlaceDeduction>"PlaceDeduction"</book1:PlaceDeduction>
                <book1:AutoScratched>"AutoScratched"</book1:AutoScratched>
                <book1:ExcludeChecks>"ExcludeChecks"</book1:ExcludeChecks>
                <book1:PlaceLock>"PlaceLock"</book1:PlaceLock>
                <book1:LongDisplayName>"LongDisplayName"</book1:LongDisplayName>
                <book1:ExternalId>"ExternalId"</book1:ExternalId>
                <book1:RetailAvailabilityCategory>"RetailAvailabilityCategory"</book1:RetailAvailabilityCategory>
            </tem:oldOffer>
            <tem:newOffer>
                <book1:OfferId>"OfferId"</book1:OfferId>
                <book1:SubEventId>"SubEventId"</book1:SubEventId>
                <book1:OfferName>"OfferName"</book1:OfferName>
                <book1:Status>"Status"</book1:Status>
                <book1:SortOrder>"SortOrder"</book1:SortOrder>
                <book1:PlayerNo>"PlayerNo"</book1:PlayerNo>
                <book1:HAD>"HAD"</book1:HAD>
                <book1:WWRetailReturn>"WWRetailReturn"</book1:WWRetailReturn>
                <book1:WWInternetReturn>"WWInternetReturn"</book1:WWInternetReturn>
                <book1:WWTelebetReturn>"WWTelebetReturn"</book1:WWTelebetReturn>
                <book1:PPRetailReturn>"PPRetailReturn"</book1:PPRetailReturn>
                <book1:PPInternetReturn>"PPInternetReturn"</book1:PPInternetReturn>
                <book1:PPTelebetReturn>"PPTelebetReturn"</book1:PPTelebetReturn>
                <book1:Value1>"Value1"</book1:Value1>
                <book1:Value2>"Value2"</book1:Value2>
                <book1:LateScratching>"LateScratching"</book1:LateScratching>
                <book1:LastSerialNoB4LateScr>"LastSerialNoB4LateScr"</book1:LastSerialNoB4LateScr>
                <book1:Deduction>"Deduction"</book1:Deduction>
                <book1:PlacingPos>"PlacingPos"</book1:PlacingPos>
                <book1:Multiplier>"Multiplier"</book1:Multiplier>
                <book1:CalculationFlag>"CalculationFlag"</book1:CalculationFlag>
                <book1:PlaceMultiplier>"PlaceMultiplier"</book1:PlaceMultiplier>
                <book1:PlaceDeduction>"PlaceDeduction"</book1:PlaceDeduction>
                <book1:AutoScratched>"AutoScratched"</book1:AutoScratched>
                <book1:ExcludeChecks>"ExcludeChecks"</book1:ExcludeChecks>
                <book1:PlaceLock>"PlaceLock"</book1:PlaceLock>
                <book1:LongDisplayName>"LongDisplayName"</book1:LongDisplayName>
                <book1:ExternalId>"ExternalId"</book1:ExternalId>
                <book1:RetailAvailabilityCategory>"RetailAvailabilityCategory"</book1:RetailAvailabilityCategory>
            </tem:newOffer>
        </tem:UpdateOffer>
    </soapenv:Body>
</soapenv:Envelope>